{
  "home": {
    "title": "Home",
    "learnMoreButton": "Learn more about my work",
    "welcoming": {
      "fullStack": "Full-Stack Developer",
      "mobile": "Mobile Developer",
      "freelancer": "Freelancer",
      "javascript": "Javascript Programmer",
      "java": "Java Programmer",
      "flutter": "Flutter Programmer"
    }
  },
  "aboutMe": {
    "title": "About Me",
    "info": {
      "introduction": "Hi! My name is Jonatas, I'm a Full-Stack Developer. I work with highly complex applications that serve thousands of users worldwide.",
      "myWork": "A 4 year experienced Full Stack Web Developer, graduated in Information Systems at University of São Paulo and with great industry experience building websites and web applications."
    },
    "advantages": {
      "cleanCode": {
        "title": "Clean Code",
        "description": "I always focus on the quality of my code, following the best market practices"
      },
      "highPerformance": {
        "title": "High Performance",
        "description": "I seek to develop high performance applications, that execute smoothly with no lags"
      },
      "responsive": {
        "title": "Responsiveness",
        "description": "My layouts are always responsive and work on any device, large or small"
      },
      "multidisciplinary": {
        "title": "Multidisciplinary",
        "description": "I'm a multidisciplinary professional and can communicate well with big teams"
      }
    }
  },
  "skills": {
    "title": "Skills",
    "info": {
      "introduction": "I have a varied skillset, having the ability to work with web, mobile, design, infrastructure and intrapersonal skills.",
      "technologies": "These are some technologies that I've been working recently:"
    }
  },
  "projects": {
    "title": "Latest Experiences",
    "info": "Here are the last projects that I've worked on:",
    "check": "Check the project",
    "titles": {
      "victorJulio": "Victor Julio Fotografia",
      "myPool": "My Pool",
      "oneCard": "OneCard",
      "trinity": "Trinity Gifts",
      "estoqueTotal": "Estoque Total",
      "chacaraDantas": "Dantas Party hall"
    },
    "descriptions": {
      "victorJulio": "Responsive institutional website for the photography agency Victor Julio. The website's design was developed by me and built using Angular, a modern technology for creating websites.",
      "myPool": "Multiplatform application for pool control and management. It has several features such as registration, calculator for maximum occupancy, chlorine, pH, and various other useful functionalities. The app's design was developed by me and built using Flutter, cutting-edge technology for Android and iOS Apps.",
      "oneCard": "Web and mobile platform for OneCard corporate card clients. It features functionalities such as login, card visualization, bill payment, card blocking, among others. It has both a responsive website and multi-platform applications and was developed using Typescript in conjunction with the Capacitor framework, which generates apps and websites with a single codebase.",
      "trinity": "Responsive institutional website for Trinity Personalizados, a custom products company. The website's design was developed by me and built using NextJS, the most commonly used technology for building modern websites. It has real-time integration with Instagram, populating the portfolio based on the platform's images.",
      "estoqueTotal": "Full-stack web platform for inventory control, sales reporting, and e-commerce insights. It integrates with the ERPs Bling and Tiny and performs daily searches for products and sales through asynchronous jobs. The platform was developed with a microservices architecture, using NodeJS as a backend framework, as well as ORMs for the relational database integration. Besides, it has built using several SOLID concepts. The web portion was developed using React, one of the most commonly used technologies in modern web projects.",
      "chacaraDantas": "Responsive institutional website for Chacara Dantas, an event space for parties. The website's design was developed by me and built using NextJS, the most commonly used technology for building modern websites."
    },
    "properties": {
      "mobile": "Android and iOS App",
      "web": "Responsive Website",
      "designByMe": "Design by me",
      "platform": "Web Platform",
      "microservices": "Microservices Architecture"
    },
    "company": "Company",
    "characteristics": "Characteristics",
    "access": "Access the project",
    "details": "Details",
    "confidential": "Confidential project"
  },
  "contactMe": {
    "title": "Contat Me",
    "sendMessage": "Send message",
    "whatsapp": "Send a message in Whatsapp",
    "success": "Thank you for your message! I'll get in touch as soon as possible.",
    "error": "An error ocurred when sending your message. Please try again or send me a message in Whatsapp",
    "info": {
      "introduction": "Get in touch with me so we can start working together!",
      "description": "If you prefer, my number is 55+ 11 96012-6820."
    },
    "fields": {
      "name": {
        "name": "Name",
        "required": "Name is required"
      },
      "email": {
        "name": "E-mail",
        "invalid": "Invalid Email",
        "required": "Email is required"
      },
      "phone": {
        "name": "Phone",
        "required": "Phone is required"
      },
      "message": {
        "name": "Message",
        "required": "Message is required"
      }
    }
  }
}