{
  "home": {
    "title": "Home",
    "learnMoreButton": "Conheça meu trabalho",
    "welcoming": {
      "fullStack": "Desenvolvedor Full-Stack",
      "mobile": "Desenvolvedor Mobile",
      "freelancer": "Freelancer",
      "javascript": "Programador Javascript",
      "java": "Programador Java",
      "flutter": "Programador Flutter"
    }
  },
  "aboutMe": {
    "title": "Sobre mim",
    "info": {
      "introduction": "Olá! Meu nome é Jonatas, sou desenvolvedor Full-Stack. Atuo em projetos de alta complexidade que atendem milhares de clientes em todo o mundo.",
      "myWork": "Sou graduando em Sistemas de Informação na USP, Universidade de São Paulo. Além disso, possuo cerca de 5 anos de experiência como Desenvolvedor de Software, atuando na construção de aplicações de alta complexidade."
    },
    "advantages": {
      "cleanCode": {
        "title": "Clean Code",
        "description": "Sempre prezo pela qualidade do código, seguindo as melhores práticas do mercado"
      },
      "highPerformance": {
        "title": "Alta Performance",
        "description": "Busco desenvolver aplicações de alta performance, que executam com velocidade e sem lags"
      },
      "responsive": {
        "title": "Responsivo",
        "description": "Meus layouts funcionam em qualquer dispositivo, grande ou pequeno."
      },
      "multidisciplinary": {
        "title": "Multidisciplinar",
        "description": "Possuo um Perfil multidisciplinar e me comunico bem com grandes equipes"
      }
    }
  },
  "skills": {
    "title": "Habilidades",
    "info": {
      "introduction": "Tenho um conjunto de habilidades muito diverso, variando de tecnologias para desenvolvimento web, mobile multiplataforma, design, infraestrutura e habilidades intrapessoais.",
      "technologies": "Estas são algumas tecnologias que venho trabalhando recentemente:"
    }
  },
  "projects": {
    "title": "Últimas Experiências",
    "info": "Abaixo encontram-se os últimos projetos em que atuei.",
    "check": "Veja o projeto",
    "titles": {
      "victorJulio": "Victor Julio Fotografia",
      "myPool": "Minha Piscina",
      "oneCard": "OneCard",
      "trinity": "Trinity Personalizados",
      "estoqueTotal": "Estoque Total",
      "chacaraDantas": "Chacara Dantas"
    },
    "descriptions": {
      "victorJulio": "Website institucional responsivo para a agencia de fotografia Victor Julio. O Website teve seu design desenvolvido por mim e foi construído utilizando Angular, uma tecnologia moderna para criação de websites.",
      "myPool": "Aplicativo multiplataforma para controle e gerenciamento de Piscinas. Conta com diversas funcionalidades como cadastro, calculadora para lotação máxima, cloro, PH e diversas outras funcionalidades úteis. O App teve seu design desenvolvido por mim e foi construído utilizando Flutter, tecnologia de ponta para aplicativos Android e iOS.",
      "oneCard": "Plataforma Web e Mobile para clientes da empresa de cartões coorporativos OneCard. Possui funcionalidades como Login, Visualização de cartões, pagamento de contas, bloqueio de cartões, entre outras. Possui tanto Website responsivo como aplicativos multiplataforma, e foi desenvolvido utilizando Typescript em conjunto com o framework Capacitor, que gera Apps e Websites com uma única base de código.",
      "trinity": "Website institucional responsivo para a empresa de produtos personalizados Trinity Personalizados. O Website teve seu design desenvolvido por mim e foi construído utilizando NextJS, tecnologia mais utilizada atualmente para construção de websites modernos. Possui integração com o Instagram em tempo real, preenchendo o portfolio com base nas imagens da plataforma.",
      "estoqueTotal": "Plataforma web full-stack para controle de estoque, relatórios de venda e insights sobre E-commerces. Possui integracão com os ERPs Bling e Tiny, e realiza busca de produtos e vendas diariamente, através de Jobs assíncronos. A plataforma foi desenvolvida com arquitetura de microserviços, utilizando NodeJS como Framework backend, além de conceitos SOLID e ORMs para integração com o banco de dados, SQL. A parte Web foi desenvolvida utilizando React, uma das tecnologias mais utilizadas em projetos Web modernos.",
      "chacaraDantas": "Website institucional responsivo para o espaço para festas Chacara Dantas. O Website teve seu design desenvolvido por mim e foi construído utilizando NextJS, tecnologia mais utilizada atualmente para construção de websites modernos."
    },
    "properties": {
      "mobile": "App Android e iOS",
      "web": "Website Responsivo",
      "designByMe": "Design feito por mim",
      "platform": "Sistema Web",
      "microservices": "Arquitetura de Microserviços"
    },
    "company": "Empresa",
    "characteristics": "Características",
    "access": "Acesse o projeto",
    "details": "Detalhes",
    "confidential": "Projeto confidencial"
  },
  "contactMe": {
    "title": "Contato",
    "sendMessage": "Enviar Mensagem",
    "whatsapp": "Me chame no Whatsapp",
    "success": "Obrigado pela mensagem! Irei entrar em contato assim que possível.",
    "error": "Ocorreu um erro no envio da mensagem. Por favor, tente novamente ou me chame no Whatsapp.",
    "info": {
      "introduction": "Entre em contato comigo e faça um orçamento. Será um prazer atendê-lo(a)!",
      "description": "Se preferir, meu whatsapp é (11) 96012-6820."
    },
    "fields": {
      "name": {
        "name": "Nome",
        "required": "Nome é obrigatório"
      },
      "email": {
        "name": "E-mail",
        "invalid": "Email inválido",
        "required": "Email é obrigatório"
      },
      "phone": {
        "name": "Telefone",
        "min": "Mínimo de 11 caracteres",
        "required": "Telefone é obrigatório"
      },
      "message": {
        "name": "Mensagem",
        "required": "Mensagem obrigatória"
      }
    }
  }
}